output-desired.txt
=== Iteration 1 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: Laying out IO file (1 file / 1MiB) test: (groupid=0, jobs=1): err= 0: pid=43448: Tue Nov 7 01:57:46 2023 write: IOPS=18.3k, BW=71.4MiB/s (74.9MB/s)(1024KiB/14msec); 0 zone resets slat (nsec): min=7043, max=41469, avg=8013.13, stdev=2340.24 clat (usec): min=17, max=6716, avg=44.51, stdev=418.66 lat (usec): min=24, max=6759, avg=52.68, stdev=420.80 clat percentiles (usec): | 1.00th=[ 18], 5.00th=[ 18], 10.00th=[ 18], 20.00th=[ 19], | 30.00th=[ 19], 40.00th=[ 19], 50.00th=[ 19], 60.00th=[ 19], | 70.00th=[ 19], 80.00th=[ 19], 90.00th=[ 20], 95.00th=[ 21], | 99.00th=[ 26], 99.50th=[ 27], 99.90th=[ 6718], 99.95th=[ 6718], | 99.99th=[ 6718] lat (usec) : 20=94.53%, 50=5.08% lat (msec) : 10=0.39% cpu : usr=0.00%, sys=23.08%, ctx=256, majf=0, minf=14 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=71.4MiB/s (74.9MB/s), 71.4MiB/s-71.4MiB/s (74.9MB/s-74.9MB/s), io=1024KiB (1049kB), run=14-14msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
=== Iteration 2 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: (groupid=0, jobs=1): err= 0: pid=43467: Tue Nov 7 01:57:47 2023 write: IOPS=19.7k, BW=76.9MiB/s (80.7MB/s)(1024KiB/13msec); 0 zone resets slat (nsec): min=3707, max=70663, avg=4219.17, stdev=4237.34 clat (usec): min=14, max=6687, avg=41.68, stdev=416.98 lat (usec): min=18, max=6758, avg=46.01, stdev=421.21 clat percentiles (usec): | 1.00th=[ 15], 5.00th=[ 15], 10.00th=[ 16], 20.00th=[ 16], | 30.00th=[ 16], 40.00th=[ 16], 50.00th=[ 16], 60.00th=[ 16], | 70.00th=[ 16], 80.00th=[ 16], 90.00th=[ 17], 95.00th=[ 17], | 99.00th=[ 22], 99.50th=[ 23], 99.90th=[ 6718], 99.95th=[ 6718], | 99.99th=[ 6718] lat (usec) : 20=98.83%, 50=0.78% lat (msec) : 10=0.39% cpu : usr=0.00%, sys=16.67%, ctx=257, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=76.9MiB/s (80.7MB/s), 76.9MiB/s-76.9MiB/s (80.7MB/s-80.7MB/s), io=1024KiB (1049kB), run=13-13msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
=== Iteration 3 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: (groupid=0, jobs=1): err= 0: pid=43486: Tue Nov 7 01:57:47 2023 write: IOPS=19.7k, BW=76.9MiB/s (80.7MB/s)(1024KiB/13msec); 0 zone resets slat (nsec): min=3627, max=35777, avg=3999.09, stdev=2075.83 clat (usec): min=14, max=6733, avg=41.89, stdev=419.86 lat (usec): min=18, max=6770, avg=46.06, stdev=421.90 clat percentiles (usec): | 1.00th=[ 15], 5.00th=[ 16], 10.00th=[ 16], 20.00th=[ 16], | 30.00th=[ 16], 40.00th=[ 16], 50.00th=[ 16], 60.00th=[ 16], | 70.00th=[ 16], 80.00th=[ 16], 90.00th=[ 16], 95.00th=[ 17], | 99.00th=[ 19], 99.50th=[ 22], 99.90th=[ 6718], 99.95th=[ 6718], | 99.99th=[ 6718] lat (usec) : 20=99.22%, 50=0.39% lat (msec) : 10=0.39% cpu : usr=0.00%, sys=16.67%, ctx=256, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=76.9MiB/s (80.7MB/s), 76.9MiB/s-76.9MiB/s (80.7MB/s-80.7MB/s), io=1024KiB (1049kB), run=13-13msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
=== Iteration 4 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: (groupid=0, jobs=1): err= 0: pid=43505: Tue Nov 7 01:57:47 2023 write: IOPS=19.7k, BW=76.9MiB/s (80.7MB/s)(1024KiB/13msec); 0 zone resets slat (nsec): min=3687, max=35687, avg=4315.11, stdev=2193.14 clat (usec): min=14, max=6708, avg=41.53, stdev=418.34 lat (usec): min=18, max=6745, avg=45.98, stdev=420.35 clat percentiles (usec): | 1.00th=[ 15], 5.00th=[ 15], 10.00th=[ 15], 20.00th=[ 16], | 30.00th=[ 16], 40.00th=[ 16], 50.00th=[ 16], 60.00th=[ 16], | 70.00th=[ 16], 80.00th=[ 16], 90.00th=[ 16], 95.00th=[ 17], | 99.00th=[ 21], 99.50th=[ 23], 99.90th=[ 6718], 99.95th=[ 6718], | 99.99th=[ 6718] lat (usec) : 20=98.44%, 50=1.17% lat (msec) : 10=0.39% cpu : usr=0.00%, sys=16.67%, ctx=256, majf=0, minf=12 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=76.9MiB/s (80.7MB/s), 76.9MiB/s-76.9MiB/s (80.7MB/s-80.7MB/s), io=1024KiB (1049kB), run=13-13msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
=== Iteration 5 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: (groupid=0, jobs=1): err= 0: pid=43524: Tue Nov 7 01:57:48 2023 write: IOPS=21.3k, BW=83.3MiB/s (87.4MB/s)(1024KiB/12msec); 0 zone resets slat (nsec): min=3636, max=35717, avg=3993.75, stdev=2115.78 clat (usec): min=14, max=6711, avg=41.71, stdev=418.47 lat (usec): min=18, max=6747, avg=45.84, stdev=420.51 clat percentiles (usec): | 1.00th=[ 15], 5.00th=[ 15], 10.00th=[ 16], 20.00th=[ 16], | 30.00th=[ 16], 40.00th=[ 16], 50.00th=[ 16], 60.00th=[ 16], | 70.00th=[ 16], 80.00th=[ 16], 90.00th=[ 16], 95.00th=[ 17], | 99.00th=[ 19], 99.50th=[ 23], 99.90th=[ 6718], 99.95th=[ 6718], | 99.99th=[ 6718] lat (usec) : 20=99.22%, 50=0.39% lat (msec) : 10=0.39% cpu : usr=0.00%, sys=18.18%, ctx=256, majf=0, minf=12 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=83.3MiB/s (87.4MB/s), 83.3MiB/s-83.3MiB/s (87.4MB/s-87.4MB/s), io=1024KiB (1049kB), run=12-12msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
=== Iteration 6 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: (groupid=0, jobs=1): err= 0: pid=43543: Tue Nov 7 01:57:48 2023 write: IOPS=36.6k, BW=143MiB/s (150MB/s)(1024KiB/7msec); 0 zone resets slat (nsec): min=3597, max=34485, avg=4210.68, stdev=2276.28 clat (nsec): min=952, max=820187, avg=18650.65, stdev=50304.24 lat (usec): min=18, max=855, avg=23.00, stdev=52.25 clat percentiles (usec): | 1.00th=[ 15], 5.00th=[ 15], 10.00th=[ 16], 20.00th=[ 16], | 30.00th=[ 16], 40.00th=[ 16], 50.00th=[ 16], 60.00th=[ 16], | 70.00th=[ 16], 80.00th=[ 16], 90.00th=[ 17], 95.00th=[ 17], | 99.00th=[ 21], 99.50th=[ 21], 99.90th=[ 824], 99.95th=[ 824], | 99.99th=[ 824] lat (nsec) : 1000=0.39% lat (usec) : 20=98.44%, 50=0.78%, 1000=0.39% cpu : usr=0.00%, sys=33.33%, ctx=256, majf=0, minf=12 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=143MiB/s (150MB/s), 143MiB/s-143MiB/s (150MB/s-150MB/s), io=1024KiB (1049kB), run=7-7msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
=== Iteration 7 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: (groupid=0, jobs=1): err= 0: pid=43562: Tue Nov 7 01:57:48 2023 write: IOPS=36.6k, BW=143MiB/s (150MB/s)(1024KiB/7msec); 0 zone resets slat (nsec): min=3747, max=32802, avg=4286.51, stdev=1967.32 clat (usec): min=14, max=823, avg=18.53, stdev=50.50 lat (usec): min=18, max=857, avg=22.99, stdev=52.34 clat percentiles (usec): | 1.00th=[ 15], 5.00th=[ 15], 10.00th=[ 15], 20.00th=[ 16], | 30.00th=[ 16], 40.00th=[ 16], 50.00th=[ 16], 60.00th=[ 16], | 70.00th=[ 16], 80.00th=[ 16], 90.00th=[ 17], 95.00th=[ 17], | 99.00th=[ 19], 99.50th=[ 20], 99.90th=[ 824], 99.95th=[ 824], | 99.99th=[ 824] lat (usec) : 20=99.61%, 1000=0.39% cpu : usr=0.00%, sys=33.33%, ctx=256, majf=0, minf=12 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=143MiB/s (150MB/s), 143MiB/s-143MiB/s (150MB/s-150MB/s), io=1024KiB (1049kB), run=7-7msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
=== Iteration 8 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: (groupid=0, jobs=1): err= 0: pid=43581: Tue Nov 7 01:57:49 2023 write: IOPS=19.7k, BW=76.9MiB/s (80.7MB/s)(1024KiB/13msec); 0 zone resets slat (nsec): min=3477, max=36208, avg=3910.05, stdev=2146.88 clat (usec): min=14, max=6727, avg=42.08, stdev=419.47 lat (usec): min=18, max=6764, avg=46.11, stdev=421.54 clat percentiles (usec): | 1.00th=[ 15], 5.00th=[ 16], 10.00th=[ 16], 20.00th=[ 16], | 30.00th=[ 16], 40.00th=[ 16], 50.00th=[ 16], 60.00th=[ 16], | 70.00th=[ 16], 80.00th=[ 16], 90.00th=[ 17], 95.00th=[ 17], | 99.00th=[ 26], 99.50th=[ 27], 99.90th=[ 6718], 99.95th=[ 6718], | 99.99th=[ 6718] lat (usec) : 20=98.83%, 50=0.78% lat (msec) : 10=0.39% cpu : usr=16.67%, sys=0.00%, ctx=256, majf=0, minf=14 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=76.9MiB/s (80.7MB/s), 76.9MiB/s-76.9MiB/s (80.7MB/s-80.7MB/s), io=1024KiB (1049kB), run=13-13msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
=== Iteration 9 ===
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1 fio-3.28 Starting 1 process test: (groupid=0, jobs=1): err= 0: pid=43600: Tue Nov 7 01:57:49 2023 write: IOPS=19.7k, BW=76.9MiB/s (80.7MB/s)(1024KiB/13msec); 0 zone resets slat (nsec): min=3547, max=35507, avg=4222.22, stdev=2480.95 clat (usec): min=14, max=6714, avg=41.76, stdev=418.70 lat (usec): min=18, max=6751, avg=46.13, stdev=420.71 clat percentiles (usec): | 1.00th=[ 15], 5.00th=[ 15], 10.00th=[ 16], 20.00th=[ 16], | 30.00th=[ 16], 40.00th=[ 16], 50.00th=[ 16], 60.00th=[ 16], | 70.00th=[ 16], 80.00th=[ 16], 90.00th=[ 16], 95.00th=[ 17], | 99.00th=[ 31], 99.50th=[ 32], 99.90th=[ 6718], 99.95th=[ 6718], | 99.99th=[ 6718] lat (usec) : 20=98.83%, 50=0.78% lat (msec) : 10=0.39% cpu : usr=0.00%, sys=16.67%, ctx=256, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,256,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=76.9MiB/s (80.7MB/s), 76.9MiB/s-76.9MiB/s (80.7MB/s-80.7MB/s), io=1024KiB (1049kB), run=13-13msec Disk stats (read/write): nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%